---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.IlluminationFailures.RoomLightLossFactorWarning
source: html/43acfaf2-1741-677d-ca4d-610180b4bed1.htm
---
# Autodesk.Revit.DB.BuiltInFailures.IlluminationFailures.RoomLightLossFactorWarning Property

Estimated Illumination failed. Light Loss factor not set for lighting fixture.

## Syntax (C#)
```csharp
public static FailureDefinitionId RoomLightLossFactorWarning { get; }
```